In [204]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

ELIMINAR VALORES NAN DE LA BASE DE DATOS

In [ ]:

## Se limpian los datos, reemplazando los valores NaN por valores que no afecten el restultado
## Asi se puede colocar el mismo valor de la media en este caso con la funcion que se usa.
## Se hace una copia del DataFrame original y se usa este para no alterar el original.

In [ ]:
df.loc[:10,['salary_year_avg','salary_hour_avg']] ##Se observan valores NaN

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [6]:
median_year_salary = df['salary_year_avg'].median()
median_hour_salary = df['salary_hour_avg'].median()

In [14]:
df_filled = df
## Con esta funcion (fillna) se reemplazan los NaN y luego guardamos en si mismo
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_year_salary)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_hour_salary)

In [15]:
df_filled.loc[:10,['salary_year_avg','salary_hour_avg']] ##Se vuelven a evaluar y no hay valores NaN

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

ELIMINAR DUPLICADOS DE LA BASE DATOS

In [16]:
## Se crea otra base de datos a partir de la anterior

In [17]:
df_unique = df_filled

In [ ]:
df_unique = df_unique.drop_duplicates()
## Se usa esta funcion para encontrar y eliminar filas duplicadas y se guarda en si misma

In [19]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])
## Aqui eliminamos duplicados de esas dos columnas

Ejercicios para practicar (drop.duplicated y duplicated)

In [84]:
df_clean = df

In [21]:
## Elimina todas las filas completamente duplicadas (en todas las columnas) del DataFrame df.

In [64]:
df_clean = df_clean.drop_duplicates()
print("Antes:", len(df))
print("Después:", len(df_clean))
print('Duplicados eliminados:', len(df)-len(df_clean))

Antes: 785741
Después: 785640
Duplicados eliminados: 101

In [23]:
## Elimina las filas duplicadas solo considerando la columna 'job_title'.

In [69]:
df_clean = df_clean.drop_duplicates(subset='job_title')
print("Antes:", len(df))
print("Después:", len(df_clean))
print('Duplicados eliminados:', len(df)-len(df_clean))

Antes: 785741
Después: 234674
Duplicados eliminados: 551067

In [30]:
## Elimina duplicados en 'job_title', pero conserva la última aparición de cada trabajo.

In [32]:
df_clean = df_clean.drop_duplicates(subset='job_title',keep='last')
print("Antes:", len(df))
print("Después:", len(df_clean))
print('Duplicados eliminados:', len(df)-len(df_clean))

Antes: 785741
Después: 234674
Duplicados eliminados: 551067

In [34]:
## Elimina todos los títulos de trabajo que estén repetidos, 
## de modo que solo queden los que aparecen una sola vez en 'job_title'.

In [81]:
df_clean = df_clean.drop_duplicates(subset='job_title',keep=False)
print("Antes:", len(df))
print("Después:", len(df_clean))
print('Duplicados eliminados:', len(df)-len(df_clean))

Antes: 785640
Después: 164304
Duplicados eliminados: 621336

In [36]:
## Elimina los duplicados en todo el DataFrame sin crear una copia nueva.

In [82]:

df_clean.drop_duplicates(inplace=True)
print("Antes:", len(df))
print("Después:", len(df_clean))
print('Duplicados eliminados:', len(df)-len(df_clean))

Antes: 785640
Después: 164304
Duplicados eliminados: 621336

C:\Users\JK_al\AppData\Local\Temp\ipykernel_2748\295929820.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean.drop_duplicates(inplace=True)

In [55]:
df_clear = df
duplicados = df_clear.duplicated().sum()
duplicados

np.int64(101)

In [ ]:
## Encuentra qué filas están duplicadas en 'job_title' y muéstralas.

In [94]:
df_clean[~df_clean.duplicated(subset='job_title', keep=False)]

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
6,Senior Data Engineer,Senior Data Engineer - GCP Cloud,"Dearborn, MI",via LinkedIn,Full-time,False,"Florida, United States",2023-03-27 13:18:18,False,False,United States,None,NaN,NaN,"Miracle Software Systems, Inc","['sql', 'python', 'java', 'sql server', 'gcp',...","{'cloud': ['gcp', 'bigquery'], 'databases': ['..."
8,Business Analyst,Technology & Operations Business Analyst,"Copenhagen, Denmark",via Trabajo.org,Full-time,False,Denmark,2023-06-05 13:44:34,False,False,Denmark,None,NaN,NaN,Hempel,"['excel', 'powerpoint', 'power bi']","{'analyst_tools': ['excel', 'powerpoint', 'pow..."
23,Machine Learning Engineer,"PhD position in computer science (NLP, finance)",Russia,via hh.ru,Full-time,False,Russia,2023-09-30 13:52:00,False,False,Russia,None,NaN,NaN,Грешнев Олег Владимирович,"['python', 'r']","{'programming': ['python', 'r']}"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785721,Business Analyst,IT Business Analyst Data,Jerman,melalui Indeed,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,NaN,NaN,Raisin,"['sql', 'python', 'aws', 'looker', 'tableau', ...","{'analyst_tools': ['looker', 'tableau', 'splun..."
785722,Business Analyst,Business Analytics Training and Internship,Jerman,melalui LinkedIn,None,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,NaN,NaN,OESON,['python'],{'programming': ['python']}
785734,Business Analyst,PreSales Engineer,"Almaty, Kazakhstan",melalui Melga,Pekerjaan tetap,False,Kazakhstan,2023-03-12 06:31:13,False,False,Kazakhstan,None,NaN,NaN,Staff-UP Consulting Group,['windows'],{'os': ['windows']}
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

Ejercicios para practicar (fillna)

In [ ]:
## Para comprobar si tienes valores nulos 'isna()' y sum() para contarlos

In [126]:
df.isna().sum()

job_title_short               0
job_title                     1
job_location               1045
job_via                       8
job_schedule_type         12667
job_work_from_home            0
search_location               0
job_posted_date               0
job_no_degree_mention         0
job_health_insurance          0
job_country                  49
salary_rate              752674
salary_year_avg          763738
salary_hour_avg          775079
company_name                 18
job_skills               117037
job_type_skills          117037
dtype: int64

In [141]:
df_unicos = df

In [104]:
## Reemplaza los valores nulos en la columna 'company_location' por "Unknown".

In [108]:
df_unicos['job_location'] = df_unicos['job_location'].fillna('Unknown')

In [109]:
df_unicos['job_location'].isna().sum()

np.int64(0)

In [107]:
## En la columna 'salary_year_avg', reemplaza los valores NaN con la media de los salarios existentes.

In [114]:
promedio_salary = df_unicos['salary_year_avg'].mean()
df_unicos['salary_year_avg'] = df_unicos['salary_year_avg'].fillna(promedio_salary)

In [115]:
df_unicos['salary_year_avg'].isna().sum()

np.int64(0)

In [ ]:
## Rellena los nulos con: 'job_title' → "Sin título", 'job_country' → "Desconocido", 'salary_year_avg' → 0

In [123]:
df_unicos = df_unicos.fillna({ 'job_title':'Sin titulo',
                   'job_country':'Desconocido',
                   'salary_hour_avg': 0      })

In [ ]:
## Rellena los valores nulos del DataFrame usando el último valor válido anterior o posterior dependiendo

In [ ]:
df_unicos = df_unicos.fillna(method='bfill')

C:\Users\JK_al\AppData\Local\Temp\ipykernel_2748\1478639544.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_unicos = df_unicos.fillna(method='bfill')

In [139]:
df_unicos.head(5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,year,109500.0,97.5,Boehringer Ingelheim,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,year,109500.0,97.5,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,year,109500.0,97.5,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,year,109500.0,97.5,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,year,109500.0,97.5,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [142]:
## Si 'job_location' es nulo, rellénalo con 'job_country'.

In [145]:
Valor_antes = df_unicos['job_location'].isna().sum()
df_unicos['job_location'] = df_unicos['job_location'].fillna(df_unicos['job_country'])
Valor_despues = df_unicos['job_location'].isna().sum()
print(Valor_antes)
print(Valor_despues)

1045
1

Ejercicios con 'dropna()'

In [155]:
df_limpio = df

In [156]:
df_limpio.isna().sum()

job_title_short               0
job_title                     1
job_location               1045
job_via                       8
job_schedule_type         12667
job_work_from_home            0
search_location               0
job_posted_date               0
job_no_degree_mention         0
job_health_insurance          0
job_country                  49
salary_rate              752674
salary_year_avg          763738
salary_hour_avg          775079
company_name                 18
job_skills               117037
job_type_skills          117037
dtype: int64

In [148]:
## Eliminar todas las filas con al menos un NaN

In [164]:
df_limpio1 = df_limpio.dropna()

In [165]:
df_limpio1.isna().sum()

job_title_short          0
job_title                0
job_location             0
job_via                  0
job_schedule_type        0
job_work_from_home       0
search_location          0
job_posted_date          0
job_no_degree_mention    0
job_health_insurance     0
job_country              0
salary_rate              0
salary_year_avg          0
salary_hour_avg          0
company_name             0
job_skills               0
job_type_skills          0
dtype: int64

In [161]:
## Eliminar solo filas con todos los valores NaN

In [162]:
df_limpio2 = df_limpio.dropna(how="all")

In [163]:
df_limpio2.isna().sum()

job_title_short               0
job_title                     1
job_location               1045
job_via                       8
job_schedule_type         12667
job_work_from_home            0
search_location               0
job_posted_date               0
job_no_degree_mention         0
job_health_insurance          0
job_country                  49
salary_rate              752674
salary_year_avg          763738
salary_hour_avg          775079
company_name                 18
job_skills               117037
job_type_skills          117037
dtype: int64

In [166]:
## Eliminar columnas con valores NaN

In [167]:
df_limpio3 = df_limpio.dropna(axis=1)

In [168]:
df_limpio3.isna().sum()

job_title_short          0
job_work_from_home       0
search_location          0
job_posted_date          0
job_no_degree_mention    0
job_health_insurance     0
dtype: int64

In [169]:
df_limpio3.head(5)

,job_title_short,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance
0,Senior Data Engineer,False,"Texas, United States",2023-06-16 13:44:15,False,False
1,Data Analyst,False,Mexico,2023-01-14 13:18:07,False,False
2,Data Engineer,False,Germany,2023-10-10 13:14:55,False,False
3,Data Engineer,False,"Texas, United States",2023-07-04 13:01:41,True,False
4,Data Engineer,False,Sudan,2023-08-07 14:29:36,False,False

In [176]:
## Eliminar filas solo si faltan datos en una columna específica, 'salary_year_avg' sea NaN

In [186]:
df_limpio7 = df_limpio.dropna(subset=['salary_year_avg'])

In [187]:
df_limpio7.head(5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,NaN,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd..."
77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,NaN,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,NaN,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}"
100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,NaN,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr..."
109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,NaN,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro..."

In [171]:
df_limpio4 = df_limpio['salary_year_avg'].dropna()

In [174]:
df_limpio4.head(5)

28     109500.0
77     140000.0
92     120000.0
100    228222.0
109     89000.0
Name: salary_year_avg, dtype: float64

In [175]:
## Eliminar filas donde falten valores en varias columnas específicas, 'job_title' o 'company_location'

In [177]:
df_limpio5 = df_limpio[['job_title','job_location']].dropna()

In [179]:
df_limpio5.isna().sum()

job_title       0
job_location    0
dtype: int64

In [188]:
df_limpio5 = df_limpio.dropna(subset=['job_title','job_location'])

In [189]:
df_limpio5.head(5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [180]:
df_limpio6 = df_limpio.dropna(axis=1,how='all')

In [185]:
df_limpio6.isna().sum()

job_title_short               0
job_title                     1
job_location               1045
job_via                       8
job_schedule_type         12667
job_work_from_home            0
search_location               0
job_posted_date               0
job_no_degree_mention         0
job_health_insurance          0
job_country                  49
salary_rate              752674
salary_year_avg          763738
salary_hour_avg          775079
company_name                 18
job_skills               117037
job_type_skills          117037
dtype: int64

In [ ]:
## Reiniciar el índice después de eliminar filas

In [192]:
df_reset = df_limpio.dropna().reset_index(drop=True)

In [195]:
# Remove rows where the salary_year_avg column has missing values. 
# Display the number of rows before and after removing.

In [197]:
antes = len(df)
df_new = df.dropna(subset=['salary_year_avg'])
despues = len(df_new)
print(antes, despues)

785741 22003

In [198]:
# Remove duplicate rows from the DataFrame based on the job_location column. 
# Display the number of rows before and after removing duplicates.

In [199]:
dupli_antes = len(df)
df_new2 = df.drop_duplicates(subset=['job_location'])
dupli_despues = len(df_new2)
print(f' {dupli_antes} y {dupli_despues}')

 785741 y 17218

In [200]:
# Fill missing values in the salary_rate column with the string 'Unknown'. 
# Display the first 10 rows of the salary_rate column before and after filling.

In [203]:
df_newfill = df
antes_fill = df_newfill['salary_rate'].head(10)
df_newfill['salary_rate']= df_newfill['salary_rate'].fillna('Unknown')
despues_fill = df_newfill['salary_rate'].head(10)
print(f' {antes_fill} y {despues_fill}')

 0    None
1    None
2    None
3    None
4    None
5    None
6    None
7    None
8    None
9    None
Name: salary_rate, dtype: object y 0    Unknown
1    Unknown
2    Unknown
3    Unknown
4    Unknown
5    Unknown
6    Unknown
7    Unknown
8    Unknown
9    Unknown
Name: salary_rate, dtype: object

Ejercicios con 'replace'

In [205]:
df_replace = df

In [ ]:
#REEMPLAZO VALOR DE TEXTO

df_rep1 = df['job_location'].replace('US','United States')
df_rep1
# Reemplaza "US" por "United States" en la columna 'company_location'.

0                               Watertown, CT
1                Guadalajara, Jalisco, Mexico
2                             Berlin, Germany
3                             San Antonio, TX
4                              Washington, DC
                         ...
785736                              Singapura
785737                     Bad Rodach, Jerman
785738                               Malaysia
785739    Newark, New Jersey, Amerika Serikat
785740                                  India
Name: job_location, Length: 785741, dtype: object

In [239]:
# REEMPLAZO VARIOS TEXTOS EN UNA COLUMNA

df_rep2 = df['job_schedule_type'].replace({'FT':'Full-time','PT':'Part-time'})
df_rep2
# En la columna 'employment_type', cambia: "FT" → "Full-time", "PT" → "Part-time"

0               Full-time
1               Full-time
2               Full-time
3               Full-time
4               Full-time
               ...
785736    Pekerjaan tetap
785737    Pekerjaan tetap
785738    Pekerjaan tetap
785739    Pekerjaan tetap
785740    Pekerjaan tetap
Name: job_schedule_type, Length: 785741, dtype: object

In [241]:
# REEMPLAZO DE UNICO VALOR NUMERICO (Numpy)
import numpy as np

df_rep3 = df['salary_year_avg'].replace(0, np.nan)
df_rep3

# Si 'salary_year_avg' tiene algún valor igual a 0, se reemplaza por NaN

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
785736   NaN
785737   NaN
785738   NaN
785739   NaN
785740   NaN
Name: salary_year_avg, Length: 785741, dtype: float64

In [242]:
# REEMPLAZO DE VARIOS VALORES NUMERICOS (Numpy)

df_rep4 = df['salary_year_avg'].replace([0,-1], np.nan)
df_rep4
# Reemplaza [0, -1] por None en 'salary_year_avg'.

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
785736   NaN
785737   NaN
785738   NaN
785739   NaN
785740   NaN
Name: salary_year_avg, Length: 785741, dtype: float64

In [ ]:
# REEMPLAZO VARIOS VALORES PARA VARIAS COLUMNAS

df_rep5 = df['salary_year_avg'].replace({
                                          'company_size': {'S': 'Small', 'M': 'Medium', 'L': 'Large'},
                                          'job_schedule_type': {'FT': 'Full-time', 'CT': 'Contract'}
                                        })
df_rep5
# En 'company_size': "S" → "Small", "M" → "Medium". En 'employment_type': "FT" → "Full-time", "CT" → "Contract"

In [244]:
# REEMPLAZO DE VALOR CON EXPRESIONES REGULARES (regex=True)

df_rep6 = df['job_title'].replace(r'(?i)data', 'Information', regex=True)
df_rep6
# Reemplaza la palabra "Data" (mayúsculas o minúsculas) por "Information".
# la r'' indica la expresion regular. El modificador (?i) indica "ignorar mayúsculas/minúsculas".

0         Senior Clinical Information Engineer / Princip...
1                                       Information Analyst
2         Information Engineer/Scientist/Analyst, Mid or...
3         LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...
4                             Information Engineer- Sr Jobs
                                ...
785736                                      DevOps Engineer
785737                              CRM Information Analyst
785738                       Commercial Analyst - Start Now
785739    Principal Associate, Information Engineer (Rem...
785740                                   AWS System Analyst
Name: job_title, Length: 785741, dtype: object

In [245]:
# REEMPLAZO VALORES DIRECTAMENTE EN EL DATAFRAME ORIGINAL

df_replace['job_location'].replace('Remote', 'Remote Work', inplace=True)

C:\Users\JK_al\AppData\Local\Temp\ipykernel_2748\1687494580.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_replace['job_location'].replace('Remote', 'Remote Work', inplace=True)

In [246]:
# REEMPLAZO DE VALORES NULOS CON UN TEXTO (SE PUEDE USAR FILLNA())

df_rep7 = df['job_location'].replace(np.nan, 'Unknown')
df_rep7

0                               Watertown, CT
1                Guadalajara, Jalisco, Mexico
2                             Berlin, Germany
3                             San Antonio, TX
4                              Washington, DC
                         ...
785736                              Singapura
785737                     Bad Rodach, Jerman
785738                               Malaysia
785739    Newark, New Jersey, Amerika Serikat
785740                                  India
Name: job_location, Length: 785741, dtype: object

In [247]:
# REEMPLAZO CON CONDICIONAL (SE USA LOC[] CON LA CONDICION)

mean_salary = df_replace['salary_year_avg'].mean()
df_replace.loc[df_replace['salary_year_avg'] < 10000, 'salary_year_avg'] = mean_salary
# Todos los salarios menores de 10000 se reemplazan por el promedio.

In [249]:
# REEMPLAZO POR TEXTO PARCIAL CON EXPRESIONES REGULARES

df_rep8 = df['job_title'].replace(r'Engineer', 'Eng.', regex=True)
df_rep8
# "Data Engineer" → "Data Eng.".

0         Senior Clinical Data Eng. / Principal Clinical...
1                                              Data Analyst
2         Data Eng./Scientist/Analyst, Mid or Senior (m/...
3         LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...
4                                        Data Eng.- Sr Jobs
                                ...
785736                                          DevOps Eng.
785737                                     CRM Data Analyst
785738                       Commercial Analyst - Start Now
785739     Principal Associate, Data Eng. (Remote-Eligible)
785740                                   AWS System Analyst
Name: job_title, Length: 785741, dtype: object